Tekla Open API Reference for Tekla Structures 2025
AnalysisModelJobProperties.ApprovedDate Property
 The date of the approval.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DateTime ApprovedDate { get; set; }
Public Property ApprovedDate As DateTime
	Get
	Set
Property Value
Type: DateTime
See Also
Reference
AnalysisModelJobProperties Class
Tekla.Structures.Analysis Namespace